In [53]:
%pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in c:\users\temit\appdata\roaming\python\python311\site-packages (2.3.2)
Requirement already satisfied: numpy>=1.23.2 in c:\users\temit\appdata\roaming\python\python311\site-packages (from pandas) (2.3.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\temit\appdata\roaming\python\python311\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\temit\appdata\roaming\python\python311\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\temit\appdata\roaming\python\python311\site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in c:\users\temit\appdata\roaming\python\python311\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.0 -> 25.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [54]:
# importing necessary dependencies
import pandas as pd
from datetime import datetime, timedelta

In [55]:
zulo_bank = pd.read_csv('Dataset/zulo_bank.csv')

In [56]:
zulo_bank.head(5)

,FullName,Email,Phone,TransactionType,Amount,TransactionDate,AccountType,Balance,OpeningDate,LoanAmount,LoanType,StartDate,EndDate,InterestRate
0,Carol Miller,yfisher@example.org,6088279027,withdrawal,102.15,2023-04-26,Savings,5652.16,2019-08-12,NaN,NaN,NaN,NaN,NaN
1,Geoffrey Banks,gonzalesgeorge@example.net,001-546-857-6518x5359,withdrawal,358.80,2020-06-13,Credit,2881.24,2019-05-06,32428.90,Mortgage,2021-06-24,2050-01-08 04:59:17.907588,2.12
2,Geoffrey Banks,gonzalesgeorge@example.net,001-546-857-6518x5359,withdrawal,358.80,2020-06-13,Credit,2881.24,2019-05-06,31406.77,Personal,2021-02-27,2038-10-12 04:59:17.907821,4.63
3,Geoffrey Banks,gonzalesgeorge@example.net,001-546-857-6518x5359,withdrawal,358.80,2020-06-13,Credit,2881.24,2019-05-06,27834.00,Personal,2019-12-05,2037-08-15 04:59:17.909497,2.15
4,Geoffrey Banks,gonzalesgeorge@example.net,001-546-857-6518x5359,withdrawal,358.80,2020-06-13,Credit,2881.24,2019-05-06,27873.08,Auto,2022-01-19,2037-06-03 04:59:17.913974,7.03

In [57]:
zulo_bank.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1554 entries, 0 to 1553
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   FullName         1554 non-null   object
 1   Email            1554 non-null   object
 2   Phone            1554 non-null   object
 3   TransactionType  1554 non-null   object
 4   Amount           1554 non-null   float64
 5   TransactionDate  1554 non-null   object
 6   AccountType      1554 non-null   object
 7   Balance          1554 non-null   float64
 8   OpeningDate      1554 non-null   object
 9   LoanAmount       1278 non-null   float64
 10  LoanType         1278 non-null   object
 11  StartDate        1278 non-null   object
 12  EndDate          1278 non-null   object
 13  InterestRate     1278 non-null   float64
dtypes: float64(4), object(10)
memory usage: 170.1+ KB

In [58]:
# clean dataset
zulo_bank.fillna({
    'LoanAmount': 0.0,
    'LoanType': 'Unknown',
    'InterestRate': 0.0
}, inplace=True)

In [59]:
# convert fullName into firstName and lastName
zulo_bank[['FirstName', 'LastName']] = zulo_bank['FullName'].str.split(expand=True)
zulo_bank.head(5)

,FullName,Email,Phone,TransactionType,Amount,TransactionDate,AccountType,Balance,OpeningDate,LoanAmount,LoanType,StartDate,EndDate,InterestRate,FirstName,LastName
0,Carol Miller,yfisher@example.org,6088279027,withdrawal,102.15,2023-04-26,Savings,5652.16,2019-08-12,0.00,Unknown,NaN,NaN,0.00,Carol,Miller
1,Geoffrey Banks,gonzalesgeorge@example.net,001-546-857-6518x5359,withdrawal,358.80,2020-06-13,Credit,2881.24,2019-05-06,32428.90,Mortgage,2021-06-24,2050-01-08 04:59:17.907588,2.12,Geoffrey,Banks
2,Geoffrey Banks,gonzalesgeorge@example.net,001-546-857-6518x5359,withdrawal,358.80,2020-06-13,Credit,2881.24,2019-05-06,31406.77,Personal,2021-02-27,2038-10-12 04:59:17.907821,4.63,Geoffrey,Banks
3,Geoffrey Banks,gonzalesgeorge@example.net,001-546-857-6518x5359,withdrawal,358.80,2020-06-13,Credit,2881.24,2019-05-06,27834.00,Personal,2019-12-05,2037-08-15 04:59:17.909497,2.15,Geoffrey,Banks
4,Geoffrey Banks,gonzalesgeorge@example.net,001-546-857-6518x5359,withdrawal,358.80,2020-06-13,Credit,2881.24,2019-05-06,27873.08,Auto,2022-01-19,2037-06-03 04:59:17.913974,7.03,Geoffrey,Banks

In [60]:
# convert 1NF to 2NF
# Create Customer table
customer = zulo_bank[['FirstName', 'LastName', 'Email', 'Phone']].copy().drop_duplicates().reset_index(drop=True)
customer['Customer_id'] = range(1, len(customer) + 1)
customer = customer[['Customer_id', 'FirstName', 'LastName', 'Email', 'Phone']]

customer.head(5)

,Customer_id,FirstName,LastName,Email,Phone
0,1,Carol,Miller,yfisher@example.org,6088279027
1,2,Geoffrey,Banks,gonzalesgeorge@example.net,001-546-857-6518x5359
2,3,Eric,Phillips,mark13@example.com,(699)516-7638x82918
3,4,Paul,Noble,harrisonrachel@example.net,+1-586-758-3968x3144
4,5,Ryan,Alexander,loganjohn@example.org,900.377.1792x148

In [61]:
# Create account table
account = zulo_bank[['AccountType', 'Balance', 'OpeningDate']].copy().drop_duplicates().reset_index(drop=True)
account['Account_id'] = range(1, len(account) + 1)
account = account[['Account_id', 'AccountType', 'Balance', 'OpeningDate']]

account.head(5)

   Account_id AccountType  Balance OpeningDate
0           1     Savings  5652.16  2019-08-12
1           2      Credit  2881.24  2019-05-06
2           3     Savings  2391.90  2020-09-17
3           4      Credit  7880.53  2023-08-14
4           5      Credit  3020.69  2019-08-13

In [62]:
# Create transaction table
transaction = zulo_bank[['TransactionType', 'Amount', 'TransactionDate']].copy().drop_duplicates().reset_index(drop=True)
transaction['Transaction_id'] = range(1, len(transaction) + 1)
transaction = transaction[['Transaction_id', 'TransactionType', 'Amount', 'TransactionDate']]

transaction.head(5)

   Transaction_id TransactionType  Amount TransactionDate
0               1      withdrawal  102.15      2023-04-26
1               2      withdrawal  358.80      2020-06-13
2               3         deposit  112.41      2019-05-17
3               4         deposit  463.13      2020-09-02
4               5      withdrawal   21.94      2022-07-03

In [63]:
# Create Loan table
loan = zulo_bank[['LoanType', 'LoanAmount', 'StartDate', 'EndDate', 'InterestRate']].copy().drop_duplicates().reset_index(drop=True)
loan['Loan_id'] = range(1, len(loan) + 1)
loan = loan[['Loan_id', 'LoanType', 'LoanAmount', 'StartDate', 'EndDate', 'InterestRate']]

loan.head(5)

,Loan_id,LoanType,LoanAmount,StartDate,EndDate,InterestRate
0,1,Unknown,0.00,NaN,NaN,0.00
1,2,Mortgage,32428.90,2021-06-24,2050-01-08 04:59:17.907588,2.12
2,3,Personal,31406.77,2021-02-27,2038-10-12 04:59:17.907821,4.63
3,4,Personal,27834.00,2019-12-05,2037-08-15 04:59:17.909497,2.15
4,5,Auto,27873.08,2022-01-19,2037-06-03 04:59:17.913974,7.03

In [64]:
# Merge all tables to create a Zulo bank table
zulo_bank.merge(customer, on=['FirstName', 'LastName', 'Email', 'Phone'], how='left') \
         .merge(account, on=['AccountType', 'Balance', 'OpeningDate'], how='left') \
         .merge(transaction, on=['TransactionType', 'Amount', 'TransactionDate'], how='left') \
         .merge(loan, on=['LoanAmount', 'LoanType', 'StartDate', 'EndDate', 'InterestRate'], how='left') \
         [['Customer_id', 'Account_id', 'Transaction_id', 'Loan_id']]

      Customer_id  Account_id  Transaction_id  Loan_id
0               1           1               1        1
1               2           2               2        2
2               2           2               2        3
3               2           2               2        4
4               2           2               2        5
...           ...         ...             ...      ...
1549           20         165             997       29
1550           20         165             997       30
1551           25          94             998        1
1552            5          68             999       11
1553            6          76            1000       12

[1554 rows x 4 columns]

In [65]:
# convert 2NF to 3NF
# Create the date dimension table
# define the start and end date
start_date = datetime(2020, 1, 1)
end_date = datetime(2090, 12, 31)

# calculate the number of days between start and end date
num_days = (end_date - start_date).days

# generate a list of dates from start to current date
date_list = [start_date + timedelta(days=x) for x in range(num_days + 1)]

# Ensure date_id matches the length of date_list
date = {'date_id': [x for x in range(1, len(date_list) + 1)], 'date': date_list}

# Create Date DataFrame
date_dim = pd.DataFrame(date)
date_dim['day'] = date_dim['date'].dt.day
date_dim['month'] = date_dim['date'].dt.month
date_dim['year'] = date_dim['date'].dt.year
date_dim['date'] = pd.to_datetime(date_dim['date']).dt.date

date_dim.head(5)

   date_id        date  day  month  year
0        1  2020-01-01    1      1  2020
1        2  2020-01-02    2      1  2020
2        3  2020-01-03    3      1  2020
3        4  2020-01-04    4      1  2020
4        5  2020-01-05    5      1  2020

In [66]:
# Make sure both are datetime.date
account['OpeningDate'] = pd.to_datetime(account['OpeningDate']).dt.date
date_dim['date'] = pd.to_datetime(date_dim['date']).dt.date  # convert to date only

# Now merge
account = (
    account.merge(date_dim, left_on='OpeningDate', right_on='date', how='inner')
           .rename(columns={'date_id': 'OpeningDate_ID'})
           .reset_index(drop=True)
           [['Account_id', 'AccountType', 'Balance', 'OpeningDate_ID']]
)
account.head(5)

   Account_id AccountType  Balance  OpeningDate_ID
0           3     Savings  2391.90             261
1           4      Credit  7880.53            1322
2           6     Savings   947.43             857
3           7     Savings  4492.62             244
4           8      Credit  8439.15             310

In [67]:
# Transaction table 2NF to 3NF
transaction['TransactionDate'] = pd.to_datetime(transaction['TransactionDate']).dt.date
transaction = (
    transaction.merge(date_dim, left_on='TransactionDate', right_on='date', how='inner')\
               .rename(columns={'date_id': 'TransactionDate_ID'})\
               .reset_index(drop=True)\
               [['Transaction_id', 'TransactionType', 'Amount', 'TransactionDate_ID']]
)
transaction.head(5)

   Transaction_id TransactionType  Amount  TransactionDate_ID
0               1      withdrawal  102.15                1212
1               2      withdrawal  358.80                 165
2               4         deposit  463.13                 246
3               5      withdrawal   21.94                 915
4               8      withdrawal  256.62                 873

In [68]:
zulo_bank.columns

Index(['FullName', 'Email', 'Phone', 'TransactionType', 'Amount',
       'TransactionDate', 'AccountType', 'Balance', 'OpeningDate',
       'LoanAmount', 'LoanType', 'StartDate', 'EndDate', 'InterestRate',
       'FirstName', 'LastName'],
      dtype='object')

In [69]:
loan['StartDate'] = pd.to_datetime(
    loan['StartDate'].replace("Unknown", pd.NA), 
    errors='coerce'
).dt.date

loan['EndDate'] = pd.to_datetime(
    loan['EndDate'].replace("Unknown", pd.NA), 
    errors='coerce'
).dt.date

loan = loan.dropna(subset=['StartDate', 'EndDate'])

loan = (
    loan.merge(date_dim, left_on='StartDate', right_on='date', how='inner')
        .rename(columns={'date_id': 'StartDate_ID'})
        .merge(date_dim, left_on='EndDate', right_on='date', how='inner', suffixes=('', '_end'))
        .rename(columns={'date_id': 'EndDate_ID'})
        [['Loan_id', 'LoanAmount', 'LoanType', 'StartDate_ID', 'EndDate_ID', 'InterestRate']]
)
loan.head(5)

   Loan_id  LoanAmount  LoanType  StartDate_ID  EndDate_ID  InterestRate
0        2    32428.90  Mortgage           541       10966          2.12
1        3    31406.77  Personal           424        6860          4.63
2        5    27873.08      Auto           750        6364          7.03
3        6    25666.75      Auto          1225        7058          6.84
4        7    23853.85  Personal          1491        6618          7.41

In [70]:
# Save the tables as CSV files
transaction.to_csv(r'Database_model/transaction.csv', index=False)
loan.to_csv(r'Database_model/loan.csv', index=False)
account.to_csv(r'Database_model/account.csv', index=False)
customer.to_csv(r'Database_model/customer.csv', index=False)
date_dim.to_csv(r'Database_model/date_dim.csv', index=False)
zulo_bank.to_csv(r'Database_model/zulo_bank_cleaned.csv', index=False)

#### Transaction DWH Schema

In [71]:
transaction_dim = transaction[['Transaction_id', 'TransactionType']].copy().drop_duplicates().reset_index(drop=True)
account_dim = account[['Account_id', 'AccountType', 'Balance']].copy().drop_duplicates().reset_index(drop=True)

transaction_fact_table = zulo_bank.merge(transaction, on='Transaction_id', how='inner') \
                                  .merge(account, on='Account_id', how='inner') \
                                  [['Transaction_id', 'Account_id', 'OpeningDate_ID', 'Amount','TransactionDate_ID']]

KeyError: 'Transaction_id'

In [73]:
# Create unique lookup tables
transaction_lookup = transaction[['TransactionType', 'Transaction_id']].drop_duplicates()
account_lookup = account[['AccountType', 'Account_id']].drop_duplicates()

# Merge safely
zulo_bank = zulo_bank.merge(transaction_lookup, on='TransactionType', how='left')
zulo_bank = zulo_bank.merge(account_lookup, on='AccountType', how='left')

# Map transaction type to transaction_id
zulo_bank = zulo_bank.merge(
    transaction[['Transaction_id', 'TransactionType']],
    on='TransactionType',
    how='left'
)
# Map account type to account_id
zulo_bank = zulo_bank.merge(
    account[['Account_id', 'AccountType']],
    on='AccountType',
    how='left'
)
transaction_fact_table = (
    zulo_bank[['Transaction_id', 'Account_id', 'OpeningDate', 'TransactionDate', 'Amount']]
    .merge(date_dim, left_on='OpeningDate', right_on='date', how='left')
    .rename(columns={'date_id': 'OpeningDate_ID'})
    .merge(date_dim, left_on='TransactionDate', right_on='date', how='left')
    .rename(columns={'date_id': 'TransactionDate_ID'})
    [['Transaction_id', 'Account_id', 'OpeningDate_ID', 'TransactionDate_ID', 'Amount']]
    .drop_duplicates()
    .reset_index(drop=True)
)
transaction_fact_table.head(5)

MemoryError: Unable to allocate 1.93 GiB for an array with shape (258514674,) and data type int64